In [2]:
data = {
    '이름' : ['김자바', '이자바', '박자바', '최캐드', '정캐드']
    , '학급' : ['자바반', '자바반', '자바반', '캐드반', '캐드반']
    , '국어점수' : [90, 80, 70, 100, 90]
    , '영어점수' : [70, 80, 80, 70, 90]
    , '평균' : [80.0, 80.0, 75.0, 85.0, 90.0]
    , '취미' : ['독서', '', '', '요가', '축구']
}

In [3]:
import pandas as pd
df = pd.DataFrame(data)
df

    이름   학급  국어점수  영어점수    평균  취미
0  김자바  자바반    90    70  80.0  독서
1  이자바  자바반    80    80  80.0
2  박자바  자바반    70    80  75.0
3  최캐드  캐드반   100    70  85.0  요가
4  정캐드  캐드반    90    90  90.0  축구

In [4]:
df.describe()

             국어점수     영어점수         평균
count    5.000000   5.0000   5.000000
mean    86.000000  78.0000  82.000000
std     11.401754   8.3666   5.700877
min     70.000000  70.0000  75.000000
25%     80.000000  70.0000  80.000000
50%     90.000000  80.0000  80.000000
75%     90.000000  80.0000  85.000000
max    100.000000  90.0000  90.000000

In [10]:
# 특정 컬럼의 통계 확인
df['국어점수'].min()
df['국어점수'].max()
df['국어점수'].mean() #평균
df['국어점수'].count() #갯수 !Nan 값은 갯수에서 제외!
df['국어점수'].sum() #합계
df['국어점수'].nlargest(3) #내림차순 3번째까지

3    100
0     90
4     90
Name: 국어점수, dtype: int64

In [13]:
df['학급'].unique() #컬럼의 중복 제외 후 데이터
df['학급'].nunique() #컬럼의 중복 제외한 데이터 갯수

2